//AUTH03   JOB (ACCT#),'FERNAND',MSGCLASS=H,REGION=4M,
//             CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID,TIME=(0,5),
//             COND=(4,LT)
//*
//         JCLLIB  ORDER=SDJ.FORM.PROCLIB
//*
//COMPCIC  EXEC COMPCICS,NOMPGM=AUTH03
//STEPCIC.SYSIN    DD DSN=API7.SOURCE.COBOL(&NOMPGM),DISP=SHR
//STEPCOB.SYSLIB   DD
//                 DD
//                 DD DSN=API7.SOURCE.COPY,DISP=SHR
/*