//JCBMS03  JOB (ACCT#),'FERNAND',MSGLEVEL=(1,1),
//             CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID
//             JCLLIB ORDER=SDJ.FORM.PROCLIB
//             EXEC COMPMAP,MAP=MS03
//STEPEXT.SYSUT1   DD DSN=API7.SOURCE.BMS(&MAP),DISP=SHR
//STEPCOP.SYSPUNCH DD DSN=API7.SOURCE.COPY(&MAP),DISP=SHR